[
  {"id":"amezquitaOrchestratingSinglecellAnalysis2019","abstract":"This Perspective highlights open-source software for single-cell analysis released as part of the Bioconductor project, providing an overview for users and developers.","accessed":{"date-parts":[[2019,12,5]]},"author":[{"family":"Amezquita","given":"Robert A."},{"family":"Lun","given":"Aaron T. L."},{"family":"Becht","given":"Etienne"},{"family":"Carey","given":"Vince J."},{"family":"Carpp","given":"Lindsay N."},{"family":"Geistlinger","given":"Ludwig"},{"family":"Martini","given":"Federico"},{"family":"Rue-Albrecht","given":"Kevin"},{"family":"Risso","given":"Davide"},{"family":"Soneson","given":"Charlotte"},{"family":"Waldron","given":"Levi"},{"family":"Pagès","given":"Hervé"},{"family":"Smith","given":"Mike L."},{"family":"Huber","given":"Wolfgang"},{"family":"Morgan","given":"Martin"},{"family":"Gottardo","given":"Raphael"},{"family":"Hicks","given":"Stephanie C."}],"container-title":"Nature Methods","container-title-short":"Nat Methods","DOI":"10.1038/s41592-019-0654-x","ISSN":"1548-7105","issued":{"date-parts":[[2019,12,2]]},"language":"en","page":"1-9","source":"www.nature.com","title":"Orchestrating single-cell analysis with Bioconductor","type":"article-journal","URL":"https://www.nature.com/articles/s41592-019-0654-x"},
  {"id":"baisScdsComputationalAnnotation2020","abstract":"Single-cell RNA sequencing (scRNA-seq) technologies enable the study of transcriptional heterogeneity at the resolution of individual cells and have an increasing impact on biomedical research. However, it is known that these methods sometimes wrongly consider two or more cells as single cells, and that a number of so-called doublets is present in the output of such experiments. Treating doublets as single cells in downstream analyses can severely bias a study’s conclusions, and therefore computational strategies for the identification of doublets are needed.With scds, we propose two new approaches for in silico doublet identification: Co-expression based doublet scoring (cxds) and binary classification based doublet scoring (bcds). The co-expression based approach, cxds, utilizes binarized (absence/presence) gene expression data and, employing a binomial model for the co-expression of pairs of genes, yields interpretable doublet annotations. bcds, on the other hand, uses a binary classification approach to discriminate artificial doublets from original data. We apply our methods and existing computational doublet identification approaches to four datasets with experimental doublet annotations and find that our methods perform at least as well as the state of the art, at comparably little computational cost. We observe appreciable differences between methods and across datasets and that no approach dominates all others. In summary, scds presents a scalable, competitive approach that allows for doublet annotation of datasets with thousands of cells in a matter of seconds.scds is implemented as a Bioconductor R package (doi: 10.18129/B9.bioc.scds).Supplementary data are available at Bioinformatics online.","accessed":{"date-parts":[[2020,12,27]]},"author":[{"family":"Bais","given":"Abha S"},{"family":"Kostka","given":"Dennis"}],"container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btz698","ISSN":"1367-4803","issue":"4","issued":{"date-parts":[[2020,2,15]]},"page":"1150-1158","source":"Silverchair","title":"scds: computational annotation of doublets in single-cell RNA sequencing data","title-short":"scds","type":"article-journal","URL":"https://doi.org/10.1093/bioinformatics/btz698","volume":"36"},
  {"id":"bernsteinSoloDoublet2020","abstract":"Single-cell RNA sequencing (scRNA-seq) measurements of gene expression enable an unprecedented high-resolution view into cellular state. However, current methods often result in two or more cells that share the same cell-identifying barcode; these “doublets” violate the fundamental premise of single-cell technology and can lead to incorrect inferences. Here, we describe Solo, a semi-supervised deep learning approach that identifies doublets with greater accuracy than existing methods. Solo embeds cells unsupervised using a variational autoencoder and then appends a feed-forward neural network layer to the encoder to form a supervised classifier. We train this classifier to distinguish simulated doublets from the observed data. Solo can be applied in combination with experimental doublet detection methods to further purify scRNA-seq data to true single cells. It is freely available from https://github.com/calico/solo. A record of this paper’s transparent peer review process is included in the Supplemental Information.","accessed":{"date-parts":[[2020,6,30]]},"author":[{"family":"Bernstein","given":"Nicholas J."},{"family":"Fong","given":"Nicole L."},{"family":"Lam","given":"Irene"},{"family":"Roy","given":"Margaret A."},{"family":"Hendrickson","given":"David G."},{"family":"Kelley","given":"David R."}],"container-title":"Cell Systems","container-title-short":"Cell Systems","DOI":"10.1016/j.cels.2020.05.010","ISSN":"2405-4712","issued":{"date-parts":[[2020,6,26]]},"language":"en","source":"ScienceDirect","title":"Solo: Doublet Identification in Single-Cell RNA-Seq via Semi-Supervised Deep Learning","title-short":"Solo","type":"article-journal","URL":"http://www.sciencedirect.com/science/article/pii/S2405471220301952"},
  {"id":"bloomEstimatingFrequencyMultiplets2018","abstract":"In single-cell RNA-sequencing, it is important to know the frequency at which the sequenced transcriptomes actually derive from multiple cells. A common method to estimate this multiplet frequency is to mix two different types of cells (e.g., human and mouse), and then determine how often the transcriptomes contain transcripts from both cell types. When the two cell types are mixed in equal proportion, the calculation of the multiplet frequency from the frequency of mixed transcriptomes is straightforward. But surprisingly, there are no published descriptions of how to calculate the multiplet frequency in the general case when the cell types are mixed unequally. Here, I derive equations to analytically calculate the multiplet frequency from the numbers of observed pure and mixed transcriptomes when two cell types are mixed in arbitrary proportions, under the assumption that the loading of cells into droplets or wells is Poisson.","accessed":{"date-parts":[[2019,5,13]]},"author":[{"family":"Bloom","given":"Jesse D."}],"container-title":"PeerJ","DOI":"10.7717/peerj.5578","ISSN":"2167-8359","issued":{"date-parts":[[2018,9,3]]},"language":"en","page":"e5578","source":"DOI.org (Crossref)","title":"Estimating the frequency of multiplets in single-cell RNA sequencing from cell-mixing experiments","type":"article-journal","URL":"https://peerj.com/articles/5578","volume":"6"},
  {"id":"depasqualeDoubletDeconDeconvoluting2019","abstract":"Methods for single-cell RNA sequencing (scRNAseq) have greatly advanced in recent years. While droplet- and well-based methods have increased the capture frequency of cells for scRNA-seq, these technologies readily produce technical artifacts, such as doublet cell captures. Doublets occurring between distinct cell types can appear as hybrid scRNA-seq proﬁles, but do not have distinct transcriptomes from individual cell states. We introduce DoubletDecon, an approach that detects doublets with a combination of deconvolution analyses and the identiﬁcation of unique cell-state gene expression. We demonstrate the ability of DoubletDecon to identify synthetic, mixed-species, genetic, and cell-hashing cell doublets from scRNA-seq datasets of varying cellular complexity with a high sensitivity relative to alternative approaches. Importantly, this algorithm prevents the prediction of valid mixedlineage and transitional cell states as doublets by considering their unique gene expression. DoubletDecon has an easy-to-use graphical user interface and is compatible with diverse species and unsupervised population detection algorithms.","accessed":{"date-parts":[[2020,4,2]]},"author":[{"family":"DePasquale","given":"Erica A.K."},{"family":"Schnell","given":"Daniel J."},{"family":"Van Camp","given":"Pieter-Jan"},{"family":"Valiente-Alandí","given":"Íñigo"},{"family":"Blaxall","given":"Burns C."},{"family":"Grimes","given":"H. Leighton"},{"family":"Singh","given":"Harinder"},{"family":"Salomonis","given":"Nathan"}],"container-title":"Cell Reports","container-title-short":"Cell Reports","DOI":"10.1016/j.celrep.2019.09.082","ISSN":"22111247","issue":"6","issued":{"date-parts":[[2019,11]]},"language":"en","page":"1718-1727.e8","source":"DOI.org (Crossref)","title":"DoubletDecon: Deconvoluting Doublets from Single-Cell RNA-Sequencing Data","title-short":"DoubletDecon","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S2211124719312860","volume":"29"},
  {"id":"germainPipeCompGeneral2020b","abstract":"We present pipeComp (https://github.com/plger/pipeComp), a flexible R framework for pipeline comparison handling interactions between analysis steps and relying on multi-level evaluation metrics. We apply it to the benchmark of single-cell RNA-sequencing analysis pipelines using simulated and real datasets with known cell identities, covering common methods of filtering, doublet detection, normalization, feature selection, denoising, dimensionality reduction, and clustering. pipeComp can easily integrate any other step, tool, or evaluation metric, allowing extensible benchmarks and easy applications to other fields, as we demonstrate through a study of the impact of removal of unwanted variation on differential expression analysis.","accessed":{"date-parts":[[2020,9,2]]},"author":[{"family":"Germain","given":"Pierre-Luc"},{"family":"Sonrel","given":"Anthony"},{"family":"Robinson","given":"Mark D."}],"container-title":"Genome Biology","container-title-short":"Genome Biol","DOI":"10.1186/s13059-020-02136-7","ISSN":"1474-760X","issue":"1","issued":{"date-parts":[[2020,12]]},"language":"en","page":"227","source":"DOI.org (Crossref)","title":"pipeComp, a general framework for the evaluation of computational pipelines, reveals performant single cell RNA-seq preprocessing tools","type":"article-journal","URL":"https://genomebiology.biomedcentral.com/articles/10.1186/s13059-020-02136-7","volume":"21"},
  {"id":"granjaArchRScalableSoftware2021","abstract":"The advent of single-cell chromatin accessibility profiling has accelerated the ability to map gene regulatory landscapes but has outpaced the development of scalable software to rapidly extract biological meaning from these data. Here we present a software suite for single-cell analysis of regulatory chromatin in R (ArchR; https://www.archrproject.com/) that enables fast and comprehensive analysis of single-cell chromatin accessibility data. ArchR provides an intuitive, user-focused interface for complex single-cell analyses, including doublet removal, single-cell clustering and cell type identification, unified peak set generation, cellular trajectory identification, DNA element-to-gene linkage, transcription factor footprinting, mRNA expression level prediction from chromatin accessibility and multi-omic integration with single-cell RNA sequencing (scRNA-seq). Enabling the analysis of over 1.2 million single cells within 8 h on a standard Unix laptop, ArchR is a comprehensive software suite for end-to-end analysis of single-cell chromatin accessibility that will accelerate the understanding of gene regulation at the resolution of individual cells.","accessed":{"date-parts":[[2021,2,26]]},"author":[{"family":"Granja","given":"Jeffrey M."},{"family":"Corces","given":"M. Ryan"},{"family":"Pierce","given":"Sarah E."},{"family":"Bagdatli","given":"S. Tansu"},{"family":"Choudhry","given":"Hani"},{"family":"Chang","given":"Howard Y."},{"family":"Greenleaf","given":"William J."}],"container-title":"Nature Genetics","DOI":"10.1038/s41588-021-00790-6","ISSN":"1546-1718","issued":{"date-parts":[[2021,2,25]]},"language":"en","page":"1-9","publisher":"Nature Publishing Group","source":"www.nature.com","title":"ArchR is a scalable software package for integrative single-cell chromatin accessibility analysis","type":"article-journal","URL":"https://www.nature.com/articles/s41588-021-00790-6"},
  {"id":"hicksMbkmeansFastClustering2021","abstract":"Single-cell RNA-Sequencing (scRNA-seq) is the most widely used high-throughput technology to measure genome-wide gene expression at the single-cell level. One of the most common analyses of scRNA-seq data detects distinct subpopulations of cells through the use of unsupervised clustering algorithms. However, recent advances in scRNA-seq technologies result in current datasets ranging from thousands to millions of cells. Popular clustering algorithms, such as k-means, typically require the data to be loaded entirely into memory and therefore can be slow or impossible to run with large datasets. To address this problem, we developed the mbkmeans R/Bioconductor package, an open-source implementation of the mini-batch k-means algorithm. Our package allows for on-disk data representations, such as the common HDF5 file format widely used for single-cell data, that do not require all the data to be loaded into memory at one time. We demonstrate the performance of the mbkmeans package using large datasets, including one with 1.3 million cells. We also highlight and compare the computing performance of mbkmeans against the standard implementation of k-means and other popular single-cell clustering methods. Our software package is available in Bioconductor at https://bioconductor.org/packages/mbkmeans.","accessed":{"date-parts":[[2021,8,5]]},"author":[{"family":"Hicks","given":"Stephanie C."},{"family":"Liu","given":"Ruoxi"},{"family":"Ni","given":"Yuwei"},{"family":"Purdom","given":"Elizabeth"},{"family":"Risso","given":"Davide"}],"container-title":"PLOS Computational Biology","container-title-short":"PLOS Computational Biology","DOI":"10.1371/journal.pcbi.1008625","ISSN":"1553-7358","issue":"1","issued":{"date-parts":[[2021,1,26]]},"language":"en","page":"e1008625","publisher":"Public Library of Science","source":"PLoS Journals","title":"mbkmeans: Fast clustering for single cell data using mini-batch k-means","title-short":"mbkmeans","type":"article-journal","URL":"https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1008625","volume":"17"},
  {"id":"kangMultiplexedDropletSinglecell2018","abstract":"Droplet single-cell RNA-sequencing (dscRNA-seq) has enabled rapid, massively parallel profiling of transcriptomes. However, assessing differential expression across multiple individuals has been hampered by inefficient sample processing and technical batch effects. Here we describe a computational tool, demuxlet, that harnesses natural genetic variation to determine the sample identity of each droplet containing a single cell (singlet) and detect droplets containing two cells (doublets). These capabilities enable multiplexed dscRNA-seq experiments in which cells from unrelated individuals are pooled and captured at higher throughput than in standard workflows. Using simulated data, we show that 50 single-nucleotide polymorphisms (SNPs) per cell are sufficient to assign 97% of singlets and identify 92% of doublets in pools of up to 64 individuals. Given genotyping data for each of eight pooled samples, demuxlet correctly recovers the sample identity of >99% of singlets and identifies doublets at rates consistent with previous estimates. We apply demuxlet to assess cell-type-specific changes in gene expression in 8 pooled lupus patient samples treated with interferon (IFN)-β and perform eQTL analysis on 23 pooled samples.","accessed":{"date-parts":[[2019,3,10]]},"author":[{"family":"Kang","given":"Hyun Min"},{"family":"Subramaniam","given":"Meena"},{"family":"Targ","given":"Sasha"},{"family":"Nguyen","given":"Michelle"},{"family":"Maliskova","given":"Lenka"},{"family":"McCarthy","given":"Elizabeth"},{"family":"Wan","given":"Eunice"},{"family":"Wong","given":"Simon"},{"family":"Byrnes","given":"Lauren"},{"family":"Lanata","given":"Cristina M."},{"family":"Gate","given":"Rachel E."},{"family":"Mostafavi","given":"Sara"},{"family":"Marson","given":"Alexander"},{"family":"Zaitlen","given":"Noah"},{"family":"Criswell","given":"Lindsey A."},{"family":"Ye","given":"Chun Jimmie"}],"container-title":"Nature Biotechnology","DOI":"10.1038/nbt.4042","ISSN":"1546-1696","issue":"1","issued":{"date-parts":[[2018,1]]},"language":"en","page":"89-94","source":"www.nature.com","title":"Multiplexed droplet single-cell RNA-sequencing using natural genetic variation","type":"article-journal","URL":"https://www.nature.com/articles/nbt.4042","volume":"36"},
  {"id":"lutgeCellMixSQuantifyingVisualizing2021","abstract":"<p>A key challenge in single-cell RNA-sequencing (scRNA-seq) data analysis is batch effects that can obscure the biological signal of interest. Although there are various tools and methods to correct for batch effects, their performance can vary. Therefore, it is important to understand how batch effects manifest to adjust for them. Here, we systematically explore batch effects across various scRNA-seq datasets according to magnitude, cell type specificity, and complexity. We developed a cell-specific mixing score (cms) that quantifies mixing of cells from multiple batches. By considering distance distributions, the score is able to detect local batch bias as well as differentiate between unbalanced batches and systematic differences between cells of the same cell type. We compare metrics in scRNA-seq data using real and synthetic datasets and whereas these metrics target the same question and are used interchangeably, we find differences in scalability, sensitivity, and ability to handle differentially abundant cell types. We find that cell-specific metrics outperform cell type–specific and global metrics and recommend them for both method benchmarks and batch exploration.</p>","accessed":{"date-parts":[[2021,6,16]]},"author":[{"family":"Lütge","given":"Almut"},{"family":"Zyprych-Walczak","given":"Joanna"},{"family":"Kunzmann","given":"Urszula Brykczynska"},{"family":"Crowell","given":"Helena L."},{"family":"Calini","given":"Daniela"},{"family":"Malhotra","given":"Dheeraj"},{"family":"Soneson","given":"Charlotte"},{"family":"Robinson","given":"Mark D."}],"container-title":"Life Science Alliance","DOI":"10.26508/lsa.202001004","ISSN":"2575-1077","issue":"6","issued":{"date-parts":[[2021,6,1]]},"language":"en","PMID":"33758076","publisher":"Life Science Alliance","section":"Research Articles","source":"www.life-science-alliance.org","title":"CellMixS: quantifying and visualizing batch effects in single-cell RNA-seq data","title-short":"CellMixS","type":"article-journal","URL":"https://www.life-science-alliance.org/content/4/6/e202001004","volume":"4"},
  {"id":"mcginnisDoubletFinderDoubletDetection2019","accessed":{"date-parts":[[2019,4,11]]},"author":[{"family":"McGinnis","given":"Christopher S."},{"family":"Murrow","given":"Lyndsay M."},{"family":"Gartner","given":"Zev J."}],"container-title":"Cell Systems","container-title-short":"cels","DOI":"10.1016/j.cels.2019.03.003","ISSN":"2405-4712","issue":"4","issued":{"date-parts":[[2019,4,3]]},"language":"English","page":"329-337","PMID":"30954475","source":"www.cell.com","title":"DoubletFinder: Doublet Detection in Single-Cell RNA Sequencing Data Using Artificial Nearest Neighbors","title-short":"DoubletFinder","type":"article-journal","URL":"https://www.cell.com/cell-systems/abstract/S2405-4712(19)30073-0","volume":"8"},
  {"id":"stoeckiusCellHashingBarcoded2018","abstract":"Despite rapid developments in single cell sequencing, sample-specific batch effects, detection of cell multiplets, and experimental costs remain outstanding challenges. Here, we introduce Cell Hashing, where oligo-tagged antibodies against ubiquitously expressed surface proteins uniquely label cells from distinct samples, which can be subsequently pooled. By sequencing these tags alongside the cellular transcriptome, we can assign each cell to its original sample, robustly identify cross-sample multiplets, and “super-load” commercial droplet-based systems for significant cost reduction. We validate our approach using a complementary genetic approach and demonstrate how hashing can generalize the benefits of single cell multiplexing to diverse samples and experimental designs.","accessed":{"date-parts":[[2021,7,21]]},"author":[{"family":"Stoeckius","given":"Marlon"},{"family":"Zheng","given":"Shiwei"},{"family":"Houck-Loomis","given":"Brian"},{"family":"Hao","given":"Stephanie"},{"family":"Yeung","given":"Bertrand Z."},{"family":"Mauck","given":"William M."},{"family":"Smibert","given":"Peter"},{"family":"Satija","given":"Rahul"}],"container-title":"Genome Biology","container-title-short":"Genome Biology","DOI":"10.1186/s13059-018-1603-1","ISSN":"1474-760X","issue":"1","issued":{"date-parts":[[2018,12,19]]},"page":"224","source":"BioMed Central","title":"Cell Hashing with barcoded antibodies enables multiplexing and doublet detection for single cell genomics","type":"article-journal","URL":"https://doi.org/10.1186/s13059-018-1603-1","volume":"19"},
  {"id":"stuartComprehensiveIntegrationSingleCell2019","abstract":"Single-cell transcriptomics has transformed our ability to characterize cell states, but deep biological understanding requires more than a taxonomic listing of clusters. As new methods arise to measure distinct cellular modalities, a key analytical challenge is to integrate these datasets to better understand cellular identity and function. Here, we develop a strategy to “anchor” diverse datasets together, enabling us to integrate single-cell measurements not only across scRNA-seq technologies, but also across different modalities. After demonstrating improvement over existing methods for integrating scRNA-seq data, we anchor scRNA-seq experiments with scATAC-seq to explore chromatin differences in closely related interneuron subsets and project protein expression measurements onto a bone marrow atlas to characterize lymphocyte populations. Lastly, we harmonize in situ gene expression and scRNA-seq datasets, allowing transcriptome-wide imputation of spatial gene expression patterns. Our work presents a strategy for the assembly of harmonized references and transfer of information across datasets.","accessed":{"date-parts":[[2021,8,5]]},"author":[{"family":"Stuart","given":"Tim"},{"family":"Butler","given":"Andrew"},{"family":"Hoffman","given":"Paul"},{"family":"Hafemeister","given":"Christoph"},{"family":"Papalexi","given":"Efthymia"},{"family":"Mauck","given":"William M."},{"family":"Hao","given":"Yuhan"},{"family":"Stoeckius","given":"Marlon"},{"family":"Smibert","given":"Peter"},{"family":"Satija","given":"Rahul"}],"container-title":"Cell","container-title-short":"Cell","DOI":"10.1016/j.cell.2019.05.031","ISSN":"0092-8674","issue":"7","issued":{"date-parts":[[2019,6,13]]},"language":"en","page":"1888-1902.e21","source":"ScienceDirect","title":"Comprehensive Integration of Single-Cell Data","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0092867419305598","volume":"177"},
  {"id":"tianScRNAseqMixologyBetter2018","abstract":"Single cell RNA sequencing (scRNA-seq) technology has undergone rapid development in recent years, bringing with it new challenges in data processing and analysis. This has led to an explosion of tailored analysis methods for scRNA-seq to address various biological questions. However, the current lack of gold-standard benchmarking datasets makes it difficult for researchers to evaluate the performance of the many methods. Here, we designed and carried out a realistic benchmark experiment that included mixtures of single cells or ‘pseudo-cells’ created by sampling admixtures of cells or RNA from 3 distinct cancer cell lines. Altogether we generated 10 datasets using a combination of droplet and plate-based scRNA-seq protocols, with varying data quality, population heterogeneity and noise levels. Using these benchmark datasets, we compared different protocols, evaluated the spike-in standard and multiple data analysis methods for tasks ranging from normalization and imputation, to clustering, trajectory analysis and data integration. Evaluation of methods across multiple datasets revealed some that performed well in general and others that suited specific situations. Our dataset and analysis provide a comprehensive comparison framework for benchmarking most popular scRNA-seq analysis tasks.","accessed":{"date-parts":[[2019,3,10]]},"author":[{"family":"Tian","given":"Luyi"},{"family":"Dong","given":"Xueyi"},{"family":"Freytag","given":"Saskia"},{"family":"Le Cao","given":"Kim-Anh"},{"family":"Su","given":"Shian"},{"family":"Amann-Zalcenstein","given":"Daniela"},{"family":"Weber","given":"Tom S"},{"family":"Seidi","given":"Azadeh"},{"family":"Naik","given":"Shalin"},{"family":"Ritchie","given":"Matthew E"}],"container-title":"bioRxiv","DOI":"10.1101/433102","issued":{"date-parts":[[2018,10,8]]},"language":"en","source":"DataCite","title":"scRNA-seq mixology: towards better benchmarking of single cell RNA-seq protocols and analysis methods","title-short":"scRNA-seq mixology","type":"article-journal","URL":"http://biorxiv.org/lookup/doi/10.1101/433102"},
  {"id":"wolockScrubletComputationalIdentification2019","abstract":"Summary\nSingle-cell RNA-sequencing has become a widely used, powerful approach for studying cell populations. However, these methods often generate multiplet artifacts, where two or more cells receive the same barcode, resulting in a hybrid transcriptome. In most experiments, multiplets account for several percent of transcriptomes and can confound downstream data analysis. Here, we present Single-Cell Remover of Doublets (Scrublet), a framework for predicting the impact of multiplets in a given analysis and identifying problematic multiplets. Scrublet avoids the need for expert knowledge or cell clustering by simulating multiplets from the data and building a nearest neighbor classifier. To demonstrate the utility of this approach, we test Scrublet on several datasets that include independent knowledge of cell multiplets. Scrublet is freely available for download at github.com/AllonKleinLab/scrublet.","accessed":{"date-parts":[[2019,5,22]]},"author":[{"family":"Wolock","given":"Samuel L."},{"family":"Lopez","given":"Romain"},{"family":"Klein","given":"Allon M."}],"container-title":"Cell Systems","container-title-short":"Cell Systems","DOI":"10.1016/j.cels.2018.11.005","ISSN":"2405-4712","issue":"4","issued":{"date-parts":[[2019,4,24]]},"page":"281-291.e9","source":"ScienceDirect","title":"Scrublet: Computational Identification of Cell Doublets in Single-Cell Transcriptomic Data","title-short":"Scrublet","type":"article-journal","URL":"http://www.sciencedirect.com/science/article/pii/S2405471218304745","volume":"8"},
  {"id":"xiBenchmarkingComputationalDoubletDetection2021","abstract":"In single-cell RNA sequencing (scRNA-seq), doublets form when two cells are encapsulated into one reaction volume. The existence of doublets, which appear to be—but are not—real cells, is a key confounder in scRNA-seq data analysis. Computational methods have been developed to detect doublets in scRNA-seq data; however, the scRNA-seq field lacks a comprehensive benchmarking of these methods, making it difficult for researchers to choose an appropriate method for specific analyses. We conducted a systematic benchmark study of nine cutting-edge computational doublet-detection methods. Our study included 16 real datasets, which contained experimentally annotated doublets, and 112 realistic synthetic datasets. We compared doublet-detection methods regarding detection accuracy under various experimental settings, impacts on downstream analyses, and computational efficiencies. Our results show that existing methods exhibited diverse performance and distinct advantages in different aspects. Overall, the DoubletFinder method has the best detection accuracy, and the cxds method has the highest computational efficiency. A record of this paper’s transparent peer review process is included in the Supplemental Information.","accessed":{"date-parts":[[2021,4,7]]},"author":[{"family":"Xi","given":"Nan Miles"},{"family":"Li","given":"Jingyi Jessica"}],"container-title":"Cell Systems","container-title-short":"Cell Systems","DOI":"10.1016/j.cels.2020.11.008","ISSN":"2405-4712","issue":"2","issued":{"date-parts":[[2021,2,17]]},"language":"en","page":"176-194.e6","source":"ScienceDirect","title":"Benchmarking Computational Doublet-Detection Methods for Single-Cell RNA Sequencing Data","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S2405471220304592","volume":"12"},
  {"id":"xiProtocolExecutingBenchmarking2021","abstract":"The existence of doublets is a key confounder in single-cell RNA sequencing (scRNA-seq) data analysis. Computational methods have been developed for detecting doublets from scRNA-seq data. We developed an R package DoubletCollection to integrate the installation and execution of eight doublet-detection methods. DoubletCollection also provides a unified interface to perform and visualize downstream analysis after doublet detection. Here, we present a protocol of using DoubletCollection to benchmark doublet-detection methods. This protocol can automatically accommodate new doublet-detection methods in the fast-growing scRNA-seq field.","accessed":{"date-parts":[[2021,7,21]]},"author":[{"family":"Xi","given":"Nan Miles"},{"family":"Li","given":"Jingyi Jessica"}],"container-title":"arXiv:2101.08860 [q-bio]","issued":{"date-parts":[[2021,6,25]]},"source":"arXiv.org","title":"Protocol for Executing and Benchmarking Eight Computational Doublet-Detection Methods in Single-Cell RNA Sequencing Data Analysis","type":"article-journal","URL":"http://arxiv.org/abs/2101.08860"}
]
